#### Connection to mysql

In [1]:
%load_ext sql

In [2]:
%%sql
mysql+pymysql://w-alkao:mypassword@localhost

In [3]:
%sql SHOW DATABASES;

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[('ap',),
 ('ex',),
 ('information_schema',),
 ('livestock',),
 ('mysql',),
 ('om',),
 ('performance_schema',),
 ('sys',)]

In [4]:
%sql USE ap;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

#### 1- Aggregate function

In [11]:
%%sql # Query that counts unpaid invoices and calculates the total due

SELECT COUNT(*) AS number_of_invoices,
  SUM(invoice_total - payment_total - credit_total) AS total_due
FROM Invoices
WHERE invoice_total - payment_total - credit_total > 0;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(16, Decimal('53935.52'))]

In [5]:
%%sql # Query that count and calculate the sum and average of invoices total after 01/2018

SELECT 'After 1/1/2018' AS selection_date,
  COUNT(*) AS number_of_invoices,
  ROUND(AVG(invoice_total), 2) AS avg_invoice_amt,
  SUM(invoice_total) AS total_invoice_amt
FROM Invoices
WHERE invoice_date > '2018-01-01';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('After 1/1/2018', 119, Decimal('1984.92'), Decimal('236205.61'))]

In [6]:
%%sql # Query that determine the min and max of the invoice total after 

SELECT "After 1/1/2018" AS selection_date,
  COUNT(*) AS number_of_invoices,
  MAX(invoice_total) AS highest_invoice_total,
  MIN(invoice_total) AS lowest_invoice_total
FROM Invoices
WHERE invoice_date > '2018-01-01';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('After 1/1/2018', 119, Decimal('37966.19'), Decimal('6.00'))]

In [7]:
%%sql # Select the first and last vendors with min and max

SELECT MIN(vendor_name) AS first_vendor,
  MAX(vendor_name) AS last_vendor,
  COUNT(vendor_name) AS number_of_vendors
FROM Vendors;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('Abbey Office Furnishings', 'Zylka Design', 122)]

In [8]:
%%sql # Use of DISTINCT keyword 

SELECT COUNT(DISTINCT vendor_id) AS number_of_vendors,
  COUNT(vendor_id) AS number_of_invoices,
  ROUND(AVG(invoice_total), 2) AS avg_invoice_amt,
  SUM(invoice_total) AS total_invoicie_amt
FROM Invoices
WHERE invoice_date > '2018-01-01';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(34, 119, Decimal('1984.92'), Decimal('236205.61'))]

#### 2- Group and summarize data

In [16]:
%%sql # Calculate the avg invoice amount by vendor

SELECT vendor_id, ROUND(AVG(invoice_total), 2) AS avg_invoice_amt
FROM Invoices
GROUP BY vendor_id
HAVING AVG(invoice_total) > 2000
ORDER BY avg_invoice_amt DESC;

 * mysql+pymysql://w-alkao:***@localhost
9 rows affected.

[(110, Decimal('23978.48')),
 (72, Decimal('10963.66')),
 (104, Decimal('7125.34')),
 (99, Decimal('6940.25')),
 (119, Decimal('4901.26')),
 (97, Decimal('3133.57')),
 (122, Decimal('2575.33')),
 (86, Decimal('2433.00')),
 (100, Decimal('2184.50'))]

In [19]:
%%sql # Calculate the avg invoice total by vendor name

SELECT vendor_name, vendor_state, ROUND(AVG(invoice_total), 2) AS avg_invoice_amt
FROM Vendors JOIN Invoices
  ON Vendors.vendor_id = Invoices.vendor_id
GROUP BY vendor_name
HAVING AVG(invoice_total) > 2000
ORDER BY avg_invoice_amt DESC;

 * mysql+pymysql://w-alkao:***@localhost
9 rows affected.

[('Malloy Lithographing Inc', 'MI', Decimal('23978.48')),
 ('Data Reproductions Corp', 'MI', Decimal('10963.66')),
 ('Digital Dreamworks', 'CA', Decimal('7125.34')),
 ('Bertelsmann Industry Svcs. Inc', 'CA', Decimal('6940.25')),
 ('Yesmed, Inc', 'CA', Decimal('4901.26')),
 ('Compuserve', 'OH', Decimal('3133.57')),
 ('United Parcel Service', 'NV', Decimal('2575.33')),
 ('Computerworld', 'CA', Decimal('2433.00')),
 ('Cahners Publishing Company', 'NV', Decimal('2184.50'))]

In [21]:
%%sql # count the number of invoices by vendor

SELECT vendor_id, COUNT(*) AS invoice_qty
FROM Invoices
GROUP BY vendor_id
ORDER BY invoice_qty;

 * mysql+pymysql://w-alkao:***@localhost
34 rows affected.

[(119, 1),
 (113, 1),
 (114, 1),
 (108, 1),
 (107, 1),
 (106, 1),
 (105, 1),
 (104, 1),
 (103, 1),
 (102, 1),
 (100, 1),
 (99, 1),
 (117, 1),
 (96, 1),
 (94, 1),
 (90, 1),
 (89, 1),
 (88, 1),
 (86, 1),
 (82, 1),
 (81, 1),
 (48, 1),
 (83, 2),
 (80, 2),
 (72, 2),
 (34, 2),
 (37, 3),
 (115, 4),
 (110, 5),
 (95, 6),
 (97, 7),
 (121, 8),
 (122, 9),
 (123, 47)]

In [5]:
%%sql # Calculate the number of invoices and the average invoice amount for the vendors in each state and city

SELECT vendor_state, vendor_city, COUNT(*) AS invoice_qty,
  ROUND(AVG(invoice_total), 2) AS invoice_avg
FROM Invoices JOIN Vendors
  ON Invoices.vendor_id = Vendors.vendor_id
GROUP BY vendor_state, vendor_city
ORDER BY vendor_state, vendor_city;

 * mysql+pymysql://w-alkao:***@localhost
20 rows affected.

[('AZ', 'Phoenix', 1, Decimal('662.00')),
 ('CA', 'Fresno', 19, Decimal('1208.75')),
 ('CA', 'Los Angeles', 1, Decimal('503.20')),
 ('CA', 'Oxnard', 3, Decimal('188.00')),
 ('CA', 'Pasadena', 5, Decimal('196.12')),
 ('CA', 'Sacramento', 7, Decimal('253.00')),
 ('CA', 'San Francisco', 3, Decimal('1211.04')),
 ('CA', 'Turlock', 1, Decimal('95.00')),
 ('CA', 'Valencia', 1, Decimal('6940.25')),
 ('DC', 'Washington', 1, Decimal('600.00')),
 ('MA', 'Boston', 1, Decimal('1367.50')),
 ('MI', 'Ann Arbor', 5, Decimal('23978.48')),
 ('MI', 'Auburn Hills', 2, Decimal('10963.66')),
 ('NV', 'Reno', 9, Decimal('2575.33')),
 ('NV', 'The Lake', 1, Decimal('2184.50')),
 ('OH', 'Cleves', 1, Decimal('207.78')),
 ('OH', 'Columbus', 7, Decimal('3133.57')),
 ('PA', 'Philadelphia', 2, Decimal('132.68')),
 ('TN', 'Memphis', 47, Decimal('93.15')),
 ('TX', 'Dallas', 2, Decimal('1077.21'))]

In [5]:
%%sql # Same query but now limit the groups to those with two or more invoices

SELECT vendor_state, vendor_city, COUNT(*) AS invoice_qty,
  ROUND(AVG(invoice_total), 2) AS invoice_avg
FROM Invoices I JOIN Vendors V
  ON I.vendor_id = V.vendor_id
GROUP BY vendor_state, vendor_city
HAVING COUNT(*) >= 2
ORDER BY vendor_state, vendor_city;

 * mysql+pymysql://w-alkao:***@localhost
12 rows affected.

[('CA', 'Fresno', 19, Decimal('1208.75')),
 ('CA', 'Oxnard', 3, Decimal('188.00')),
 ('CA', 'Pasadena', 5, Decimal('196.12')),
 ('CA', 'Sacramento', 7, Decimal('253.00')),
 ('CA', 'San Francisco', 3, Decimal('1211.04')),
 ('MI', 'Ann Arbor', 5, Decimal('23978.48')),
 ('MI', 'Auburn Hills', 2, Decimal('10963.66')),
 ('NV', 'Reno', 9, Decimal('2575.33')),
 ('OH', 'Columbus', 7, Decimal('3133.57')),
 ('PA', 'Philadelphia', 2, Decimal('132.68')),
 ('TN', 'Memphis', 47, Decimal('93.15')),
 ('TX', 'Dallas', 2, Decimal('1077.21'))]

In [14]:
%%sql # select invoice quantity and avg invoice total by vendor with avg invoice more than 500

SELECT vendor_name,
  COUNT(*) AS invoice_qty,
  ROUND(AVG(invoice_total), 2) AS invoice_avg
FROM Vendors v JOIN Invoices i
  ON v.vendor_id = i.vendor_id
GROUP BY vendor_name
HAVING invoice_avg > 500
ORDER BY invoice_qty DESC;

 * mysql+pymysql://w-alkao:***@localhost
20 rows affected.

[('United Parcel Service', 9, Decimal('2575.33')),
 ('Zylka Design', 8, Decimal('867.53')),
 ('Compuserve', 7, Decimal('3133.57')),
 ('Malloy Lithographing Inc', 5, Decimal('23978.48')),
 ('IBM', 2, Decimal('600.06')),
 ('Data Reproductions Corp', 2, Decimal('10963.66')),
 ('Ingram', 2, Decimal('1077.21')),
 ('Fresno County Tax Collector', 1, Decimal('856.92')),
 ('Yesmed, Inc', 1, Decimal('4901.26')),
 ('Pollstar', 1, Decimal('1750.00')),
 ('Digital Dreamworks', 1, Decimal('7125.34')),
 ('Franchise Tax Board', 1, Decimal('1600.00')),
 ('Wells Fargo Bank', 1, Decimal('662.00')),
 ('Computerworld', 1, Decimal('2433.00')),
 ('Dean Witter Reynolds', 1, Decimal('1367.50')),
 ('Bertelsmann Industry Svcs. Inc', 1, Decimal('6940.25')),
 ('Wang Laboratories, Inc.', 1, Decimal('936.93')),
 ('Cahners Publishing Company', 1, Decimal('2184.50')),
 ("Reiter's Scientific & Pro Books", 1, Decimal('600.00')),
 ('Ford Motor Credit Company', 1, Decimal('503.20'))]

In [13]:
%%sql # same query using where clause

SELECT vendor_name,
  COUNT(*) AS invoice_qty,
  ROUND(AVG(invoice_total), 2) AS invoice_avg
FROM Vendors v JOIN Invoices i
  ON v.vendor_id = i.vendor_id
WHERE invoice_total > 500
GROUP BY vendor_name
ORDER BY invoice_qty DESC;

 * mysql+pymysql://w-alkao:***@localhost
21 rows affected.

[('United Parcel Service', 9, Decimal('2575.33')),
 ('Zylka Design', 7, Decimal('946.67')),
 ('Malloy Lithographing Inc', 5, Decimal('23978.48')),
 ('Compuserve', 4, Decimal('5411.15')),
 ('Ingram', 2, Decimal('1077.21')),
 ('Computerworld', 1, Decimal('2433.00')),
 ('Wells Fargo Bank', 1, Decimal('662.00')),
 ('Ford Motor Credit Company', 1, Decimal('503.20')),
 ("Reiter's Scientific & Pro Books", 1, Decimal('600.00')),
 ('Federal Express Corporation', 1, Decimal('739.20')),
 ('Cahners Publishing Company', 1, Decimal('2184.50')),
 ('Wang Laboratories, Inc.', 1, Decimal('936.93')),
 ('Bertelsmann Industry Svcs. Inc', 1, Decimal('6940.25')),
 ('Dean Witter Reynolds', 1, Decimal('1367.50')),
 ('Yesmed, Inc', 1, Decimal('4901.26')),
 ('IBM', 1, Decimal('1083.58')),
 ('Data Reproductions Corp', 1, Decimal('21842.00')),
 ('Fresno County Tax Collector', 1, Decimal('856.92')),
 ('Franchise Tax Board', 1, Decimal('1600.00')),
 ('Digital Dreamworks', 1, Decimal('7125.34')),
 ('Pollstar', 1, Decimal('1750.00'))]

In [16]:
%%sql #number and sum of invoice total of May grouped by date

SELECT invoice_date, COUNT(*) AS invoice_qty, SUM(invoice_total) AS invoice_sum
FROM Invoices
GROUP BY invoIce_date
HAVING invoice_date BETWEEN "2018-05-01" AND "2018-05-31"
  AND COUNT(*) > 1 AND SUM(invoice_total) > 1000
ORDER BY invoice_date DESC;

 * mysql+pymysql://w-alkao:***@localhost
4 rows affected.

[(datetime.date(2018, 5, 25), 3, Decimal('2201.15')),
 (datetime.date(2018, 5, 21), 2, Decimal('8078.44')),
 (datetime.date(2018, 5, 13), 3, Decimal('1888.95')),
 (datetime.date(2018, 5, 11), 2, Decimal('5009.51'))]

In [17]:
%%sql #same query using where clause

SELECT invoice_date, COUNT(*) AS qty, SUM(invoice_total) AS i_sum
FROM Invoices
WHERE invoice_date BETWEEN "2018-05-01" AND "2018-05-31"
GROUP BY invoice_date
HAVING qty > 1 AND i_sum > 100
ORDER BY invoice_date DESC;

 * mysql+pymysql://w-alkao:***@localhost
7 rows affected.

[(datetime.date(2018, 5, 31), 2, Decimal('453.75')),
 (datetime.date(2018, 5, 25), 3, Decimal('2201.15')),
 (datetime.date(2018, 5, 23), 2, Decimal('347.75')),
 (datetime.date(2018, 5, 21), 2, Decimal('8078.44')),
 (datetime.date(2018, 5, 13), 3, Decimal('1888.95')),
 (datetime.date(2018, 5, 11), 2, Decimal('5009.51')),
 (datetime.date(2018, 5, 3), 2, Decimal('866.87'))]

In [22]:
%%sql # includes a final summary rows

SELECT vendor_id, COUNT(*) AS i_count, SUM(invoice_total) AS total
FROM Invoices
GROUP BY vendor_id WITH ROLLUP
ORDER BY i_count;

 * mysql+pymysql://w-alkao:***@localhost
35 rows affected.

[(119, 1, Decimal('4901.26')),
 (113, 1, Decimal('1750.00')),
 (114, 1, Decimal('290.00')),
 (108, 1, Decimal('450.00')),
 (107, 1, Decimal('1600.00')),
 (106, 1, Decimal('503.20')),
 (105, 1, Decimal('220.00')),
 (104, 1, Decimal('7125.34')),
 (103, 1, Decimal('1367.50')),
 (102, 1, Decimal('41.80')),
 (100, 1, Decimal('2184.50')),
 (99, 1, Decimal('6940.25')),
 (117, 1, Decimal('16.62')),
 (96, 1, Decimal('662.00')),
 (94, 1, Decimal('17.50')),
 (90, 1, Decimal('356.48')),
 (89, 1, Decimal('95.00')),
 (88, 1, Decimal('207.78')),
 (86, 1, Decimal('2433.00')),
 (82, 1, Decimal('600.00')),
 (81, 1, Decimal('936.93')),
 (48, 1, Decimal('856.92')),
 (83, 2, Decimal('2154.42')),
 (80, 2, Decimal('265.36')),
 (72, 2, Decimal('21927.31')),
 (34, 2, Decimal('1200.12')),
 (37, 3, Decimal('564.00')),
 (115, 4, Decimal('43.67')),
 (110, 5, Decimal('119892.41')),
 (95, 6, Decimal('171.01')),
 (97, 7, Decimal('21935.00')),
 (121, 8, Decimal('6940.25')),
 (122, 9, Decimal('23177.96')),
 (123, 47, Decimal('4378.02')),
 (None, 119, Decimal('236205.61'))]

In [25]:
%%sql # includes a summary row for each grouping level

SELECT vendor_state, vendor_city, COUNT(*) AS qty_vendors
FROM Vendors
WHERE vendor_state IN ("IA", "NJ")
GROUP BY vendor_state, vendor_city WITH ROLLUP;

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[('IA', 'Fairfield', 1),
 ('IA', 'Washington', 1),
 ('IA', None, 2),
 ('NJ', 'East Brunswick', 2),
 ('NJ', 'Fairfield', 1),
 ('NJ', 'Washington', 1),
 ('NJ', None, 4),
 (None, None, 6)]

In [5]:
%%sql # use with rollum on a table with null values

SELECT invoice_date, payment_date, SUM(invoice_total) AS total,
  SUM(invoice_total - credit_total - payment_total) AS balance_due
FROM Invoices
WHERE invoice_date BETWEEN "2018-07-24" AND "2018-07-31"
GROUP BY invoice_date, payment_date WITH ROLLUP;

 * mysql+pymysql://w-alkao:***@localhost
14 rows affected.

[(datetime.date(2018, 7, 24), None, Decimal('503.20'), Decimal('503.20')),
 (datetime.date(2018, 7, 24), datetime.date(2018, 8, 19), Decimal('3689.99'), Decimal('0.00')),
 (datetime.date(2018, 7, 24), datetime.date(2018, 8, 23), Decimal('67.00'), Decimal('0.00')),
 (datetime.date(2018, 7, 24), datetime.date(2018, 8, 27), Decimal('23517.58'), Decimal('0.00')),
 (datetime.date(2018, 7, 24), None, Decimal('27777.77'), Decimal('503.20')),
 (datetime.date(2018, 7, 25), datetime.date(2018, 8, 22), Decimal('1000.46'), Decimal('0.00')),
 (datetime.date(2018, 7, 25), None, Decimal('1000.46'), Decimal('0.00')),
 (datetime.date(2018, 7, 28), None, Decimal('90.36'), Decimal('90.36')),
 (datetime.date(2018, 7, 28), None, Decimal('90.36'), Decimal('90.36')),
 (datetime.date(2018, 7, 30), datetime.date(2018, 9, 3), Decimal('22.57'), Decimal('0.00')),
 (datetime.date(2018, 7, 30), None, Decimal('22.57'), Decimal('0.00')),
 (datetime.date(2018, 7, 31), None, Decimal('10976.06'), Decimal('10976.06')),
 (datetime.date(2018, 7, 31), None, Decimal('10976.06'), Decimal('10976.06')),
 (None, None, Decimal('39867.22'), Decimal('11569.62'))]

In [6]:
%%sql # substitue literals for nulls in summary rows

SELECT IF(GROUPING(invoice_date) = 1, 'Grand totals', invoice_date) AS i_date,
  IF(GROUPING(payment_date) = 1, 'Invoice date totals', payment_date) AS payment_date,
  SUM(invoice_total) AS invoice_total,
  SUM(invoice_total - credit_total - payment_total) AS balance_due
FROM Invoices
WHERE invoice_date BETWEEN "2018-07-24" AND "2018-07-31"
GROUP BY invoice_date, payment_date WITH ROLLUP;

 * mysql+pymysql://w-alkao:***@localhost
14 rows affected.

[('2018-07-24', None, Decimal('503.20'), Decimal('503.20')),
 ('2018-07-24', '2018-08-19', Decimal('3689.99'), Decimal('0.00')),
 ('2018-07-24', '2018-08-23', Decimal('67.00'), Decimal('0.00')),
 ('2018-07-24', '2018-08-27', Decimal('23517.58'), Decimal('0.00')),
 ('2018-07-24', 'Invoice date totals', Decimal('27777.77'), Decimal('503.20')),
 ('2018-07-25', '2018-08-22', Decimal('1000.46'), Decimal('0.00')),
 ('2018-07-25', 'Invoice date totals', Decimal('1000.46'), Decimal('0.00')),
 ('2018-07-28', None, Decimal('90.36'), Decimal('90.36')),
 ('2018-07-28', 'Invoice date totals', Decimal('90.36'), Decimal('90.36')),
 ('2018-07-30', '2018-09-03', Decimal('22.57'), Decimal('0.00')),
 ('2018-07-30', 'Invoice date totals', Decimal('22.57'), Decimal('0.00')),
 ('2018-07-31', None, Decimal('10976.06'), Decimal('10976.06')),
 ('2018-07-31', 'Invoice date totals', Decimal('10976.06'), Decimal('10976.06')),
 ('Grand totals', 'Invoice date totals', Decimal('39867.22'), Decimal('11569.62'))]

In [7]:
%%sql #show only summary rows

SELECT IF(GROUPING(invoice_date) = 1, 'Grand totals', invoice_date) AS i_date,
  IF(GROUPING(payment_date) = 1, 'Invoice date totals', payment_date) AS payment_date,
  SUM(invoice_total) AS i_total,
  SUM(invoice_total - credit_total - payment_total) AS balance_due
FROM Invoices
WHERE invoice_date BETWEEN '2018-07-24' AND '2018-07-31'
GROUP BY invoice_date, payment_date WITH ROLLUP
HAVING GROUPING(invoice_date) = 1 OR GROUPING(payment_date) = 1;

 * mysql+pymysql://w-alkao:***@localhost
6 rows affected.

[('2018-07-24', 'Invoice date totals', Decimal('27777.77'), Decimal('503.20')),
 ('2018-07-25', 'Invoice date totals', Decimal('1000.46'), Decimal('0.00')),
 ('2018-07-28', 'Invoice date totals', Decimal('90.36'), Decimal('90.36')),
 ('2018-07-30', 'Invoice date totals', Decimal('22.57'), Decimal('0.00')),
 ('2018-07-31', 'Invoice date totals', Decimal('10976.06'), Decimal('10976.06')),
 ('Grand totals', 'Invoice date totals', Decimal('39867.22'), Decimal('11569.62'))]

#### 3- Aggregate window functions

In [9]:
%%sql # Select statement with two aggregate window functions

SELECT vendor_id, invoice_date, invoice_total,
  SUM(invoice_total) OVER() AS total_invoices,
  SUM(invoice_total) OVER(PARTITION BY vendor_id) AS vendor_total
FROM Invoices
WHERE invoice_total > 5000;

 * mysql+pymysql://w-alkao:***@localhost
10 rows affected.

[(72, datetime.date(2018, 6, 1), Decimal('21842.00'), Decimal('172489.00'), Decimal('21842.00')),
 (97, datetime.date(2018, 8, 1), Decimal('8344.50'), Decimal('172489.00'), Decimal('16689.00')),
 (97, datetime.date(2018, 8, 1), Decimal('8344.50'), Decimal('172489.00'), Decimal('16689.00')),
 (99, datetime.date(2018, 6, 18), Decimal('6940.25'), Decimal('172489.00'), Decimal('6940.25')),
 (104, datetime.date(2018, 5, 21), Decimal('7125.34'), Decimal('172489.00'), Decimal('7125.34')),
 (110, datetime.date(2018, 5, 28), Decimal('37966.19'), Decimal('172489.00'), Decimal('119892.41')),
 (110, datetime.date(2018, 7, 19), Decimal('26881.40'), Decimal('172489.00'), Decimal('119892.41')),
 (110, datetime.date(2018, 7, 23), Decimal('20551.18'), Decimal('172489.00'), Decimal('119892.41')),
 (110, datetime.date(2018, 7, 24), Decimal('23517.58'), Decimal('172489.00'), Decimal('119892.41')),
 (110, datetime.date(2018, 7, 31), Decimal('10976.06'), Decimal('172489.00'), Decimal('119892.41'))]

In [16]:
%%sql # includes a cumulative total

SELECT vendor_id, invoice_date, invoice_total,
  SUM(invoice_total) OVER() AS total_invoices,
  SUM(invoice_total) OVER(PARTITION BY vendor_id ORDER BY invoice_total) AS vendor_total
FROM Invoices
WHERE invoice_total > 5000;

 * mysql+pymysql://w-alkao:***@localhost
10 rows affected.

[(72, datetime.date(2018, 6, 1), Decimal('21842.00'), Decimal('172489.00'), Decimal('21842.00')),
 (97, datetime.date(2018, 8, 1), Decimal('8344.50'), Decimal('172489.00'), Decimal('16689.00')),
 (97, datetime.date(2018, 8, 1), Decimal('8344.50'), Decimal('172489.00'), Decimal('16689.00')),
 (99, datetime.date(2018, 6, 18), Decimal('6940.25'), Decimal('172489.00'), Decimal('6940.25')),
 (104, datetime.date(2018, 5, 21), Decimal('7125.34'), Decimal('172489.00'), Decimal('7125.34')),
 (110, datetime.date(2018, 7, 31), Decimal('10976.06'), Decimal('172489.00'), Decimal('10976.06')),
 (110, datetime.date(2018, 7, 23), Decimal('20551.18'), Decimal('172489.00'), Decimal('31527.24')),
 (110, datetime.date(2018, 7, 24), Decimal('23517.58'), Decimal('172489.00'), Decimal('55044.82')),
 (110, datetime.date(2018, 7, 19), Decimal('26881.40'), Decimal('172489.00'), Decimal('81926.22')),
 (110, datetime.date(2018, 5, 28), Decimal('37966.19'), Decimal('172489.00'), Decimal('119892.41'))]

In [19]:
%%sql # Select statement that defines a frame

SELECT vendor_id, invoice_date, invoice_total,
  SUM(invoice_total) OVER() AS total_invoices,
  SUM(invoice_total) OVER(PARTITION BY vendor_id ORDER BY invoice_date) AS vendor_total
FROM Invoices
WHERE invoice_date BETWEEN "2018-01-01" AND "2018-04-30";

 * mysql+pymysql://w-alkao:***@localhost
13 rows affected.

[(89, datetime.date(2018, 4, 24), Decimal('95.00'), Decimal('5828.18'), Decimal('95.00')),
 (95, datetime.date(2018, 4, 30), Decimal('16.33'), Decimal('5828.18'), Decimal('16.33')),
 (96, datetime.date(2018, 4, 26), Decimal('662.00'), Decimal('5828.18'), Decimal('662.00')),
 (121, datetime.date(2018, 4, 24), Decimal('601.95'), Decimal('5828.18'), Decimal('601.95')),
 (122, datetime.date(2018, 4, 8), Decimal('3813.33'), Decimal('5828.18'), Decimal('3813.33')),
 (123, datetime.date(2018, 4, 10), Decimal('40.20'), Decimal('5828.18'), Decimal('40.20')),
 (123, datetime.date(2018, 4, 13), Decimal('138.75'), Decimal('5828.18'), Decimal('178.95')),
 (123, datetime.date(2018, 4, 16), Decimal('144.70'), Decimal('5828.18'), Decimal('381.90')),
 (123, datetime.date(2018, 4, 16), Decimal('15.50'), Decimal('5828.18'), Decimal('381.90')),
 (123, datetime.date(2018, 4, 16), Decimal('42.75'), Decimal('5828.18'), Decimal('381.90')),
 (123, datetime.date(2018, 4, 21), Decimal('172.50'), Decimal('5828.18'), Decimal('554.40')),
 (123, datetime.date(2018, 4, 24), Decimal('42.67'), Decimal('5828.18'), Decimal('597.07')),
 (123, datetime.date(2018, 4, 25), Decimal('42.50'), Decimal('5828.18'), Decimal('639.57'))]

In [18]:
%%sql # Select statement that defines a frame

SELECT vendor_id, invoice_date, invoice_total,
  SUM(invoice_total) OVER() AS total_invoices,
  SUM(invoice_total) OVER(PARTITION BY vendor_id ORDER BY invoice_date
    ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS vendor_total
FROM Invoices
WHERE invoice_date BETWEEN "2018-01-01" AND "2018-04-30";

 * mysql+pymysql://w-alkao:***@localhost
13 rows affected.

[(89, datetime.date(2018, 4, 24), Decimal('95.00'), Decimal('5828.18'), Decimal('95.00')),
 (95, datetime.date(2018, 4, 30), Decimal('16.33'), Decimal('5828.18'), Decimal('16.33')),
 (96, datetime.date(2018, 4, 26), Decimal('662.00'), Decimal('5828.18'), Decimal('662.00')),
 (121, datetime.date(2018, 4, 24), Decimal('601.95'), Decimal('5828.18'), Decimal('601.95')),
 (122, datetime.date(2018, 4, 8), Decimal('3813.33'), Decimal('5828.18'), Decimal('3813.33')),
 (123, datetime.date(2018, 4, 10), Decimal('40.20'), Decimal('5828.18'), Decimal('40.20')),
 (123, datetime.date(2018, 4, 13), Decimal('138.75'), Decimal('5828.18'), Decimal('178.95')),
 (123, datetime.date(2018, 4, 16), Decimal('144.70'), Decimal('5828.18'), Decimal('323.65')),
 (123, datetime.date(2018, 4, 16), Decimal('15.50'), Decimal('5828.18'), Decimal('339.15')),
 (123, datetime.date(2018, 4, 16), Decimal('42.75'), Decimal('5828.18'), Decimal('381.90')),
 (123, datetime.date(2018, 4, 21), Decimal('172.50'), Decimal('5828.18'), Decimal('554.40')),
 (123, datetime.date(2018, 4, 24), Decimal('42.67'), Decimal('5828.18'), Decimal('597.07')),
 (123, datetime.date(2018, 4, 25), Decimal('42.50'), Decimal('5828.18'), Decimal('639.57'))]